; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport city-sequential-8nodes-1000size-5degree-100mindistance-2trucks-3packages-1119seed

(define (problem transport-city-sequential-8nodes-1000size-5degree-100mindistance-2trucks-3packages-1119seed)
 (:domain transport)
 (:objects
  city-loc-1 - location
  city-loc-2 - location
  city-loc-3 - location
  city-loc-4 - location
  city-loc-5 - location
  city-loc-6 - location
  city-loc-7 - location
  city-loc-8 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 810,316 -> 910,12
  (road city-loc-2 city-loc-1)
  (= (road-length city-loc-2 city-loc-1) 32)
  ; 910,12 -> 810,316
  (road city-loc-1 city-loc-2)
  (= (road-length city-loc-1 city-loc-2) 32)
  ; 230,532 -> 233,736
  (road city-loc-4 city-loc-3)
  (= (road-length city-loc-4 city-loc-3) 21)
  ; 233,736 -> 230,532
  (road city-loc-3 city-loc-4)
  (= (road-length city-loc-3 city-loc-4) 21)
  ; 982,446 -> 910,12
  (road city-loc-5 city-loc-1)
  (= (road-length city-loc-5 city-loc-1) 44)
  ; 910,12 -> 982,446
  (road city-loc-1 city-loc-5)
  (= (road-length city-loc-1 city-loc-5) 44)
  ; 982,446 -> 810,316
  (road city-loc-5 city-loc-2)
  (= (road-length city-loc-5 city-loc-2) 22)
  ; 810,316 -> 982,446
  (road city-loc-2 city-loc-5)
  (= (road-length city-loc-2 city-loc-5) 22)
  ; 918,637 -> 810,316
  (road city-loc-6 city-loc-2)
  (= (road-length city-loc-6 city-loc-2) 34)
  ; 810,316 -> 918,637
  (road city-loc-2 city-loc-6)
  (= (road-length city-loc-2 city-loc-6) 34)
  ; 918,637 -> 982,446
  (road city-loc-6 city-loc-5)
  (= (road-length city-loc-6 city-loc-5) 21)
  ; 982,446 -> 918,637
  (road city-loc-5 city-loc-6)
  (= (road-length city-loc-5 city-loc-6) 21)
  ; 305,11 -> 230,532
  (road city-loc-7 city-loc-4)
  (= (road-length city-loc-7 city-loc-4) 53)
  ; 230,532 -> 305,11
  (road city-loc-4 city-loc-7)
  (= (road-length city-loc-4 city-loc-7) 53)
  ; 323,217 -> 810,316
  (road city-loc-8 city-loc-2)
  (= (road-length city-loc-8 city-loc-2) 50)
  ; 810,316 -> 323,217
  (road city-loc-2 city-loc-8)
  (= (road-length city-loc-2 city-loc-8) 50)
  ; 323,217 -> 233,736
  (road city-loc-8 city-loc-3)
  (= (road-length city-loc-8 city-loc-3) 53)
  ; 233,736 -> 323,217
  (road city-loc-3 city-loc-8)
  (= (road-length city-loc-3 city-loc-8) 53)
  ; 323,217 -> 230,532
  (road city-loc-8 city-loc-4)
  (= (road-length city-loc-8 city-loc-4) 33)
  ; 230,532 -> 323,217
  (road city-loc-4 city-loc-8)
  (= (road-length city-loc-4 city-loc-8) 33)
  ; 323,217 -> 305,11
  (road city-loc-8 city-loc-7)
  (= (road-length city-loc-8 city-loc-7) 21)
  ; 305,11 -> 323,217
  (road city-loc-7 city-loc-8)
  (= (road-length city-loc-7 city-loc-8) 21)
  (at package-1 city-loc-5)
  (at package-2 city-loc-3)
  (at package-3 city-loc-2)
  (at truck-1 city-loc-1)
  (capacity truck-1 capacity-4)
  (at truck-2 city-loc-5)
  (capacity truck-2 capacity-4)
 )
 (:goal (and
  (at package-1 city-loc-4)
  (at package-2 city-loc-4)
  (at package-3 city-loc-1)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-2 city-loc-5 package-1 capacity-3 capacity-4)
   deleted: (at package-1 city-loc-5) (capacity truck-2 capacity-4)
   added: (in package-1 truck-2) (capacity truck-2 capacity-3)
   goals met: 0 of 3
2. (drive truck-2 city-loc-5 city-loc-2)
   deleted: (at truck-2 city-loc-5)
   added: (at truck-2 city-loc-2)
   goals met: 0 of 3
3. (drive truck-2 city-loc-2 city-loc-8)
   deleted: (at truck-2 city-loc-2)
   added: (at truck-2 city-loc-8)
   goals met: 0 of 3
4. (drive truck-2 city-loc-8 city-loc-3)
   deleted: (at truck-2 city-loc-8)
   added: (at truck-2 city-loc-3)
   goals met: 0 of 3
5. (pick-up truck-2 city-loc-3 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-loc-3) (capacity truck-2 capacity-3)
   added: (in package-2 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 3
6. (drive truck-2 city-loc-3 city-loc-4)
   deleted: (at truck-2 city-loc-3)
   added: (at truck-2 city-loc-4)
   goals met: 0 of 3
7. (drive truck-1 city-loc-1 city-loc-2)
   deleted: (at truck-1 city-loc-1)
   added: (at truck-1 city-loc-2)
   goals met: 0 of 3
8. (drop truck-2 city-loc-4 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-2)
   added: (at package-1 city-loc-4) (capacity truck-2 capacity-3)
   goals met: 1 of 3
9. (drop truck-2 city-loc-4 package-2 capacity-3 capacity-4)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-3)
   added: (at package-2 city-loc-4) (capacity truck-2 capacity-4)
   goals met: 2 of 3
10. (pick-up truck-1 city-loc-2 package-3 capacity-3 capacity-4)
   deleted: (at package-3 city-loc-2) (capacity truck-1 capacity-4)
   added: (in package-3 truck-1) (capacity truck-1 capacity-3)
   goals met: 2 of 3
11. (drive truck-1 city-loc-2 city-loc-1)
   deleted: (at truck-1 city-loc-2)
   added: (at truck-1 city-loc-1)
   goals met: 2 of 3
12. (drop truck-1 city-loc-1 package-3 capacity-3 capacity-4)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-3)
   added: (at package-3 city-loc-1) (capacity truck-1 capacity-4)
   goals met: 3 of 3
